tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18345_tdd.h
#define CLC1POL_G1POL                 1649
#define CLC1POL_G2POL                 1650
#define LC1G2POL                      1651
#define LC1G3POL                      1652
#define CLC1POL_G3POL                 1653
#define LC1G4POL                      1654
#define CLC1POL_G4POL                 1655
#define CLC1POL_POL                   1656
#define LC1POL                        1657
#define CLC1SEL0                      1658
#define CLC1SEL0_D1S0                 1659
#define LC1D1S0                       1660
#define CLC1SEL0_D1S                  1661
#define LC1D1S                        1662
#define CLC1SEL0_D1S1                 1663
#define LC1D1S1                       1664
#define CLC1SEL0_D1S2                 1665
#define LC1D1S2                       1666
#define LC1D1S3                       1667
#define CLC1SEL0_D1S3                 1668
#define CLC1SEL0_D1S4                 1669
#define LC1D1S4                       1670
#define CLC1SEL0_D1S5                 1671
#define LC1D1S5                       1672
#define CLC1SEL1                      1673
#define CLC1SEL1_D2S0                 1674
#define CLC1SEL1_D2S                  1675
#define LC1D2S                        1676
#define LC1D2S0                       1677
#define CLC1SEL1_D2S1                 1678
#define LC1D2S1                       1679
#define CLC1SEL1_D2S2                 1680
#define LC1D2S2                       1681
#define LC1D2S3                       1682
#define CLC1SEL1_D2S3                 1683
#define LC1D2S4                       1684
#define CLC1SEL1_D2S4                 1685
#define LC1D2S5                       1686
#define CLC1SEL1_D2S5                 1687
#define CLC1SEL2                      1688
#define LC1D3S0                       1689
#define CLC1SEL2_D3S                  1690
#define LC1D3S                        1691
#define CLC1SEL2_D3S0                 1692
#define LC1D3S1                       1693
#define CLC1SEL2_D3S1                 1694
#define LC1D3S2                       1695
#define CLC1SEL2_D3S2                 1696
#define LC1D3S3                       1697
#define CLC1SEL2_D3S3                 1698
#define LC1D3S4                       1699
#define CLC1SEL2_D3S4                 1700
#define LC1D3S5                       1701
#define CLC1SEL2_D3S5                 1702
#define CLC1SEL3                      1703
#define CLC1SEL3_D4S                  1704
#define LC1D4S                        1705
#define LC1D4S0                       1706
#define CLC1SEL3_D4S0                 1707
#define CLC1SEL3_D4S1                 1708
#define LC1D4S1                       1709
#define LC1D4S2                       1710
#define CLC1SEL3_D4S2                 1711
#define LC1D4S3                       1712
#define CLC1SEL3_D4S3                 1713
#define LC1D4S4                       1714
#define CLC1SEL3_D4S4                 1715
#define LC1D4S5                       1716
#define CLC1SEL3_D4S5                 1717
#define CLC1GLS0                      1718
#define CLC1GLS0_D1N                  1719
#define LC1G1D1N                      1720
#define CLC1GLS0_D1T                  1721
#define LC1G1D1T                      1722
#define LC1G1D2N                      1723
#define CLC1GLS0_D2N                  1724
#define LC1G1D2T                      1725
#define CLC1GLS0_D2T                  1726
#define CLC1GLS0_D3N                  1727
#define LC1G1D3N                      1728
#define CLC1GLS0_D3T                  1729
#define LC1G1D3T                      1730
#define CLC1GLS0_D4N                  1731
#define LC1G1D4N                      1732
#define CLC1GLS0_D4T                  1733
#define LC1G1D4T                      1734
#define CLC1GLS1                      1735
#define CLC1GLS1_D1N                  1736
#define LC1G2D1N                      1737
#define LC1G2D1T                      1738
#define CLC1GLS1_D1T                  1739
#define CLC1GLS1_D2N                  1740
#define LC1G2D2N                      1741
#define LC1G2D2T                      1742
#define CLC1GLS1_D2T                  1743
#define CLC1GLS1_D3N                  1744
#define LC1G2D3N                      1745
#define LC1G2D3T                      1746
#define CLC1GLS1_D3T                  1747
#define CLC1GLS1_D4N                  1748
#define LC1G2D4N                      1749
#define LC1G2D4T                      1750
#define CLC1GLS1_D4T                  1751
#define CLC1GLS2                      1752
#define CLC1GLS2_D1N                  1753
#define LC1G3D1N                      1754
#define LC1G3D1T                      1755
#define CLC1GLS2_D1T                  1756
#define LC1G3D2N                      1757
#define CLC1GLS2_D2N                  1758
#define LC1G3D2T                      1759
#define CLC1GLS2_D2T                  1760
#define CLC1GLS2_D3N                  1761
#define LC1G3D3N                      1762
#define LC1G3D3T                      1763
#define CLC1GLS2_D3T                  1764
#define LC1G3D4N                      1765
#define CLC1GLS2_D4N                  1766
#define LC1G3D4T                      1767
#define CLC1GLS2_D4T                  1768
#define CLC1GLS3                      1769
#define LC1G4D1N                      1770
#define CLC1GLS3_G4D1N                1771
#define LC1G4D1T                      1772
#define CLC1GLS3_G4D1T                1773
#define CLC1GLS3_G4D2N                1774
#define LC1G4D2N                      1775
#define CLC1GLS3_G4D2T                1776
#define LC1G4D2T                      1777
#define LC1G4D3N                      1778
#define CLC1GLS3_G4D3N                1779
#define LC1G4D3T                      1780
#define CLC1GLS3_G4D3T                1781
#define CLC1GLS3_G4D4N                1782
#define LC1G4D4N                      1783
#define CLC1GLS3_G4D4T                1784
#define LC1G4D4T                      1785
#define CLC2CON                       1786
#define LC2MODE0                      1787
#define CLC2CON_MODE                  1788
#define LC2MODE                       1789
#define CLC2CON_MODE0                 1790
#define LC2MODE1                      1791
#define CLC2CON_MODE1                 1792
#define LC2MODE2                      1793
#define CLC2CON_MODE2                 1794
#define LC2INTN                       1795
#define CLC2CON_INTN                  1796
#define LC2INTP                       1797
#define CLC2CON_INTP                  1798
#define CLC2CON_OUT                   1799
#define LC2OUT                        1800
#define CLC2CON_EN                    1801
#define LC2EN                         1802
#define CLC2POL                       1803
#define LC2G1POL                      1804
#define CLC2POL_G1POL                 1805
#define LC2G2POL                      1806
#define CLC2POL_G2POL                 1807
#define LC2G3POL                      1808
#define CLC2POL_G3POL                 1809
#define LC2G4POL                      1810
#define CLC2POL_G4POL                 1811
#define CLC2POL_POL                   1812
#define LC2POL                        1813
#define CLC2SEL0                      1814
#define CLC2SEL0_D1S                  1815
#define LC2D1S0                       1816
#define CLC2SEL0_D1S0                 1817
#define LC2D1S                        1818
#define LC2D1S1                       1819
#define CLC2SEL0_D1S1                 1820
#define LC2D1S2                       1821
#define CLC2SEL0_D1S2                 1822
#define CLC2SEL0_D1S3                 1823
#define LC2D1S3                       1824
#define LC2D1S4                       1825
#define CLC2SEL0_D1S4                 1826
#define LC2D1S5                       1827
#define CLC2SEL0_D1S5                 1828
#define CLC2SEL1                      1829
#define LC2D2S0                       1830
#define CLC2SEL1_D2S0                 1831
#define LC2D2S                        1832
#define CLC2SEL1_D2S                  1833
#define LC2D2S1                       1834
#define CLC2SEL1_D2S1                 1835
#define LC2D2S2                       1836
#define CLC2SEL1_D2S2                 1837
#define LC2D2S3                       1838
#define CLC2SEL1_D2S3                 1839
#define LC2D2S4                       1840
#define CLC2SEL1_D2S4                 1841
#define LC2D2S5                       1842
#define CLC2SEL1_D2S5                 1843
#define CLC2SEL2                      1844
#define CLC2SEL2_D3S                  1845
#define LC2D3S0                       1846
#define CLC2SEL2_D3S0                 1847
#define LC2D3S                        1848
#define CLC2SEL2_D3S1                 1849
#define LC2D3S1                       1850
#define LC2D3S2                       1851
#define CLC2SEL2_D3S2                 1852
#define LC2D3S3                       1853
#define CLC2SEL2_D3S3                 1854
#define LC2D3S4                       1855
#define CLC2SEL2_D3S4                 1856
#define LC2D3S5                       1857
#define CLC2SEL2_D3S5                 1858
#define CLC2SEL3                      1859
#define LC2D4S0                       1860
#define CLC2SEL3_D4S                  1861
#define CLC2SEL3_D4S0                 1862
#define LC2D4S                        1863
#define LC2D4S1                       1864
#define CLC2SEL3_D4S1                 1865
#define LC2D4S2                       1866
#define CLC2SEL3_D4S2                 1867
#define CLC2SEL3_D4S3                 1868
#define LC2D4S3                       1869
#define LC2D4S4                       1870
#define CLC2SEL3_D4S4                 1871
#define LC2D4S5                       1872
#define CLC2SEL3_D4S5                 1873
#define CLC2GLS0                      1874
#define LC2G1D1N                      1875
#define CLC2GLS0_D1N                  1876
#define CLC2GLS0_D1T                  1877
#define LC2G1D1T                      1878
#define LC2G1D2N                      1879
#define CLC2GLS0_D2N                  1880
#define CLC2GLS0_D2T                  1881
#define LC2G1D2T                      1882
#define LC2G1D3N                      1883
#define CLC2GLS0_D3N                  1884
#define CLC2GLS0_D3T                  1885
#define LC2G1D3T                      1886
#define LC2G1D4N                      1887
#define CLC2GLS0_D4N                  1888
#define CLC2GLS0_D4T                  1889
#define LC2G1D4T                      1890
#define CLC2GLS1                      1891
#define CLC2GLS1_D1N                  1892
#define LC2G2D1N                      1893
#define CLC2GLS1_D1T                  1894
#define LC2G2D1T                      1895
#define CLC2GLS1_D2N                  1896
#define LC2G2D2N                      1897
#define CLC2GLS1_D2T                  1898
#define LC2G2D2T                      1899
#define LC2G2D3N                      1900
#define CLC2GLS1_D3N                  1901
#define LC2G2D3T                      1902
#define CLC2GLS1_D3T                  1903
#define LC2G2D4N                      1904
#define CLC2GLS1_D4N                  1905
#define LC2G2D4T                      1906
#define CLC2GLS1_D4T                  1907
#define CLC2GLS2                      1908
#define LC2G3D1N                      1909
#define CLC2GLS2_D1N                  1910
#define CLC2GLS2_D1T                  1911
#define LC2G3D1T                      1912
#define CLC2GLS2_D2N                  1913
#define LC2G3D2N                      1914
#define LC2G3D2T                      1915
#define CLC2GLS2_D2T                  1916
#define CLC2GLS2_D3N                  1917
#define LC2G3D3N                      1918
#define CLC2GLS2_D3T                  1919
#define LC2G3D3T                      1920
#define CLC2GLS2_D4N                  1921
#define LC2G3D4N                      1922
#define LC2G3D4T                      1923
#define CLC2GLS2_D4T                  1924
#define CLC2GLS3                      1925
#define LC2G4D1N                      1926
#define CLC2GLS3_G4D1N                1927
#define CLC2GLS3_G4D1T                1928
#define LC2G4D1T                      1929
#define CLC2GLS3_G4D2N                1930
#define LC2G4D2N                      1931
#define LC2G4D2T                      1932
#define CLC2GLS3_G4D2T                1933
#define CLC2GLS3_G4D3N                1934
#define LC2G4D3N                      1935
#define CLC2GLS3_G4D3T                1936
#define LC2G4D3T                      1937
#define LC2G4D4N                      1938
#define CLC2GLS3_G4D4N                1939
#define CLC2GLS3_G4D4T                1940
#define LC2G4D4T                      1941
#define CLC3CON                       1942
#define LC3MODE                       1943
#define CLC3CON_MODE0                 1944
#define LC3MODE0                      1945
#define CLC3CON_MODE                  1946
#define CLC3CON_MODE1                 1947
#define LC3MODE1                      1948
#define CLC3CON_MODE2                 1949
#define LC3MODE2                      1950
#define LC3INTN                       1951
#define CLC3CON_INTN                  1952
#define LC3INTP                       1953
#define CLC3CON_INTP                  1954
#define LC3OUT                        1955
#define CLC3CON_OUT                   1956
#define LC3EN                         1957
#define CLC3CON_EN                    1958
#define CLC3POL                       1959
#define LC3G1POL                      1960
#define CLC3POL_G1POL                 1961
#define LC3G2POL                      1962
#define CLC3POL_G2POL                 1963
#define CLC3POL_G3POL                 1964
#define LC3G3POL                      1965
#define LC3G4POL                      1966
#define CLC3POL_G4POL                 1967
#define LC3POL                        1968
#define CLC3POL_POL                   1969
#define CLC3SEL0                      1970
#define CLC3SEL0_D1S0                 1971
#define LC3D1S0                       1972
#define CLC3SEL0_D1S                  1973
#define LC3D1S                        1974
#define LC3D1S1                       1975
#define CLC3SEL0_D1S1                 1976
#define LC3D1S2                       1977
#define CLC3SEL0_D1S2                 1978
#define LC3D1S3                       1979
#define CLC3SEL0_D1S3                 1980
#define LC3D1S4                       1981
#define CLC3SEL0_D1S4                 1982
#define LC3D1S5                       1983
#define CLC3SEL0_D1S5                 1984
#define CLC3SEL1                      1985
#define CLC3SEL1_D2S                  1986
#define CLC3SEL1_D2S0                 1987
#define LC3D2S                        1988
#define LC3D2S0                       1989
#define CLC3SEL1_D2S1                 1990
#define LC3D2S1                       1991
#define CLC3SEL1_D2S2                 1992
#define LC3D2S2                       1993
#define CLC3SEL1_D2S3                 1994
#define LC3D2S3                       1995
#define CLC3SEL1_D2S4                 1996
#define LC3D2S4                       1997
#define CLC3SEL1_D2S5                 1998
#define LC3D2S5                       1999
#define CLC3SEL2                      2000
#define LC3D3S                        2001
#define CLC3SEL2_D3S                  2002
#define LC3D3S0                       2003
#define CLC3SEL2_D3S0                 2004
#define LC3D3S1                       2005
#define CLC3SEL2_D3S1                 2006
#define LC3D3S2                       2007
#define CLC3SEL2_D3S2                 2008
#define LC3D3S3                       2009
#define CLC3SEL2_D3S3                 2010
#define CLC3SEL2_D3S4                 2011
#define LC3D3S4                       2012
#define CLC3SEL2_D3S5                 2013
#define LC3D3S5                       2014
#define CLC3SEL3                      2015
#define CLC3SEL3_D4S0                 2016
#define LC3D4S0                       2017
#define CLC3SEL3_D4S                  2018
#define LC3D4S                        2019
#define LC3D4S1                       2020
#define CLC3SEL3_D4S1                 2021
#define LC3D4S2                       2022
#define CLC3SEL3_D4S2                 2023
#define LC3D4S3                       2024
#define CLC3SEL3_D4S3                 2025
#define LC3D4S4                       2026
#define CLC3SEL3_D4S4                 2027
#define LC3D4S5                       2028
#define CLC3SEL3_D4S5                 2029
#define CLC3GLS0                      2030
#define CLC3GLS0_D1N                  2031
#define LC3G1D1N                      2032
#define LC3G1D1T                      2033
#define CLC3GLS0_D1T                  2034
#define LC3G1D2N                      2035
#define CLC3GLS0_D2N                  2036
#define CLC3GLS0_D2T                  2037
#define LC3G1D2T                      2038
#define CLC3GLS0_D3N                  2039
#define LC3G1D3N                      2040
#define LC3G1D3T                      2041
#define CLC3GLS0_D3T                  2042
#define CLC3GLS0_D4N                  2043
#define LC3G1D4N                      2044
#define CLC3GLS0_D4T                  2045
#define LC3G1D4T                      2046
#define CLC3GLS1                      2047
#define LC3G2D1N                      2048
#define CLC3GLS1_D1N                  2049
#define CLC3GLS1_D1T                  2050
#define LC3G2D1T                      2051
#define LC3G2D2N                      2052
#define CLC3GLS1_D2N                  2053
#define LC3G2D2T                      2054
#define CLC3GLS1_D2T                  2055
#define LC3G2D3N                      2056
#define CLC3GLS1_D3N                  2057
#define CLC3GLS1_D3T                  2058
#define LC3G2D3T                      2059
#define LC3G2D4N                      2060
#define CLC3GLS1_D4N                  2061
#define LC3G2D4T                      2062
#define CLC3GLS1_D4T                  2063
#define CLC3GLS2                      2064
#define LC3G3D1N                      2065
#define CLC3GLS2_D1N                  2066
#define LC3G3D1T                      2067
#define CLC3GLS2_D1T                  2068
#define CLC3GLS2_D2N                  2069
#define LC3G3D2N                      2070
#define CLC3GLS2_D2T                  2071
#define LC3G3D2T                      2072
#define CLC3GLS2_D3N                  2073
#define LC3G3D3N                      2074
#define LC3G3D3T                      2075
#define CLC3GLS2_D3T                  2076
#define CLC3GLS2_D4N                  2077
#define LC3G3D4N                      2078
#define CLC3GLS2_D4T                  2079
#define LC3G3D4T                      2080
#define CLC3GLS3                      2081
#define LC3G4D1N                      2082
#define CLC3GLS3_G4D1N                2083
#define LC3G4D1T                      2084
#define CLC3GLS3_G4D1T                2085
#define LC3G4D2N                      2086
#define CLC3GLS3_G4D2N                2087
#define CLC3GLS3_G4D2T                2088
#define LC3G4D2T                      2089
#define LC3G4D3N                      2090
#define CLC3GLS3_G4D3N                2091
#define CLC3GLS3_G4D3T                2092
#define LC3G4D3T                      2093
#define LC3G4D4N                      2094
#define CLC3GLS3_G4D4N                2095
#define LC3G4D4T                      2096
#define CLC3GLS3_G4D4T                2097
#define CLC4CON                       2098
#define LC4MODE                       2099
#define CLC4CON_MODE                  2100
#define LC4MODE0                      2101
#define CLC4CON_MODE0                 2102
#define LC4MODE1                      2103
#define CLC4CON_MODE1                 2104
#define LC4MODE2                      2105
#define CLC4CON_MODE2                 2106
#define LC4INTN                       2107
#define CLC4CON_INTN                  2108
#define CLC4CON_INTP                  2109
#define LC4INTP                       2110
#define CLC4CON_OUT                   2111
#define LC4OUT                        2112
#define CLC4CON_EN                    2113
#define LC4EN                         2114
#define CLC4POL                       2115
#define CLC4POL_G1POL                 2116
#define LC4G1POL                      2117
#define CLC4POL_G2POL                 2118
#define LC4G2POL                      2119
#define CLC4POL_G3POL                 2120
#define LC4G3POL                      2121
#define LC4G4POL                      2122
#define CLC4POL_G4POL                 2123
#define LC4POL                        2124
#define CLC4POL_POL                   2125
#define CLC4SEL0                      2126
#define CLC4SEL0_D1S0                 2127
#define LC4D1S0                       2128
#define CLC4SEL0_D1S                  2129
#define LC4D1S                        2130
#define CLC4SEL0_D1S1                 2131
#define LC4D1S1                       2132
#define CLC4SEL0_D1S2                 2133
#define LC4D1S2                       2134
#define CLC4SEL0_D1S3                 2135
#define LC4D1S3                       2136
#define CLC4SEL0_D1S4                 2137
#define LC4D1S4                       2138
#define CLC4SEL0_D1S5                 2139
#define LC4D1S5                       2140
#define CLC4SEL1                      2141
#define LC4D2S0                       2142
#define CLC4SEL1_D2S                  2143
#define CLC4SEL1_D2S0                 2144
#define LC4D2S                        2145
#define CLC4SEL1_D2S1                 2146
#define LC4D2S1                       2147
#define LC4D2S2                       2148
#define CLC4SEL1_D2S2                 2149
#define LC4D2S3                       2150
#define CLC4SEL1_D2S3                 2151
#define LC4D2S4                       2152
#define CLC4SEL1_D2S4                 2153
#define LC4D2S5                       2154
#define CLC4SEL1_D2S5                 2155
#define CLC4SEL2                      2156
#define LC4D3S                        2157
#define CLC4SEL2_D3S                  2158
#define CLC4SEL2_D3S0                 2159
#define LC4D3S0                       2160
#define LC4D3S1                       2161
#define CLC4SEL2_D3S1                 2162
#define CLC4SEL2_D3S2                 2163
#define LC4D3S2                       2164
#define CLC4SEL2_D3S3                 2165
#define LC4D3S3                       2166
#define CLC4SEL2_D3S4                 2167
#define LC4D3S4                       2168
#define CLC4SEL2_D3S5                 2169
#define LC4D3S5                       2170
#define CLC4SEL3                      2171
#define LC4D4S0                       2172
#define LC4D4S                        2173
#define CLC4SEL3_D4S0                 2174
#define CLC4SEL3_D4S                  2175
#define LC4D4S1                       2176
#define CLC4SEL3_D4S1                 2177
#define LC4D4S2                       2178
#define CLC4SEL3_D4S2                 2179
#define LC4D4S3                       2180
#define CLC4SEL3_D4S3                 2181
#define LC4D4S4                       2182
#define CLC4SEL3_D4S4                 2183
#define LC4D4S5                       2184
#define CLC4SEL3_D4S5                 2185
#define CLC4GLS0                      2186
#define CLC4GLS0_D1N                  2187
#define LC4G1D1N                      2188
#define CLC4GLS0_D1T                  2189
#define LC4G1D1T                      2190
#define CLC4GLS0_D2N                  2191
#define LC4G1D2N                      2192
#define CLC4GLS0_D2T                  2193
#define LC4G1D2T                      2194
#define CLC4GLS0_D3N                  2195
#define LC4G1D3N                      2196
#define CLC4GLS0_D3T                  2197
#define LC4G1D3T                      2198
#define CLC4GLS0_D4N                  2199
#define LC4G1D4N                      2200
#define CLC4GLS0_D4T                  2201
#define LC4G1D4T                      2202
#define CLC4GLS1                      2203
#define CLC4GLS1_D1N                  2204
#define LC4G2D1N                      2205
#define CLC4GLS1_D1T                  2206
